//
//  TTResultModel.swift
//  myApp
//
//  Created by wangzhi on 2017/6/23.
//  Copyright © 2017年 wangzhi. All rights reserved.
//

import Foundation
import HandyJSON
public let successCode = 1
///<使用了泛型
class TTResultModel<T>:HandyJSON{
    var code:Int?
    var data:T?
    required init() {}
    
//    func test<T>(_ SomeT:T) -> T {
//        let t = SomeT
//        return t
//    }
}

class TTHomeResultModel<T>:HandyJSON{

    var top_rooms:Array<T>?
    var room_found_latest:Array<T>?
    var new_recomm_list:Array<T>?
    var app_room_list:Array<T>?
    var user_recomm_list:Array<T>?
    required init() {}
}



/*
+ (NSArray *)userManageStatus
    {
        return @[@{@"code": @(0), @"msg" : @"异常"},
        @{@"code": @(404), @"msg" : @"url 格式不正确.或者资源不存在"},
        @{@"code": @(500), @"msg" : @"url 格式不正确"},
        @{@"code": @(30301), @"msg" : @"认证失败"},
        @{@"code": @(30302), @"msg" : @"用户名或密码不正确"},
        @{@"code": @(30303), @"msg" : @"服务器登录异常"},
        @{@"code": @(30304), @"msg" : @"用户名密码认证超过请求限制"},
        @{@"code": @(30305), @"msg" : @"token失效"},
        @{@"code": @(30306), @"msg" : @"缺少必要的参数"},
        @{@"code": @(30307), @"msg" : @"用户昵称已存在"},
        @{@"code": @(30308), @"msg" : @"用户名已存在"},
        @{@"code": @(30309), @"msg" : @"用户昵称不符合规范"},
        @{@"code": @(30310), @"msg" : @"用户名必须是邮箱"},
        @{@"code": @(30311), @"msg" : @"用户密码不规范"},
        @{@"code": @(30312), @"msg" : @"用户名不存在"},
        @{@"code": @(30313), @"msg" : @"服务器请求第三方资源失败"},
        @{@"code": @(30400), @"msg" : @"内容长度超过14字符"},
        @{@"code": @(30401), @"msg" : @"内容长度超过100字符"},
        @{@"code": @(30402), @"msg" : @"用户名或密码不正确"},
        @{@"code": @(30403), @"msg" : @"服务器登录异常"},
        @{@"code": @(30404), @"msg" : @"用户名密码认证超过请求限制"},
        @{@"code": @(30405), @"msg" : @"token失效,请重新登录"},
        @{@"code": @(30406), @"msg" : @"缺少必要的参数"},
        @{@"code": @(30407), @"msg" : @"用户昵称已存在"},
        @{@"code": @(30408), @"msg" : @"用户名已经存在"},
        @{@"code": @(30409), @"msg" : @"用户昵称不符合规范"},
        @{@"code": @(30410), @"msg" : @"用户名必须是邮箱"},
        @{@"code": @(30411), @"msg" : @"用户密码不规范"},
        @{@"code": @(30412), @"msg" : @"余额不足"},
        @{@"code": @(30413), @"msg" : @"权限不足"},
        @{@"code": @(30414), @"msg" : @"房间为开始直播"},
        @{@"code": @(30415), @"msg" : @"房间已关闭直播"},
        @{@"code": @(30416), @"msg" : @"主播禁止打开"},
        @{@"code": @(30417), @"msg" : @"任务未完成"},
        @{@"code": @(30418), @"msg" : @"用户冻结"},
        @{@"code": @(30419), @"msg" : @"验证码验证失败"},
        @{@"code": @(30420), @"msg" : @"抢沙发失败（已被别人抢占,所加筹码不够）"},
        @{@"code": @(30421), @"msg" : @"恶意访问，ip，设备被禁"},
        @{@"code": @(30422), @"msg" : @"VIP专享特权，请购买VIP"},
        @{@"code": @(30423), @"msg" : @"注册太频繁"},
        @{@"code": @(30424), @"msg" : @"已被抢光，明天早点来"},
        @{@"code": @(30428), @"msg" : @"M特权用户专享礼物(或M特权等级低于礼物设定等级)"},
        @{@"code": @(30437), @"msg" : @"验证码发送太频繁，请明天再来"},
        @{@"code": @(30438), @"msg" : @"无效的修改密码链接"},
        @{@"code": @(30431), @"msg" : @"验证码格式错误"},
        @{@"code": @(30432), @"msg" : @"手机号码格式错误"},
        @{@"code": @(30433), @"msg" : @"手机号码已存在"},
        @{@"code": @(30434), @"msg" : @"邮箱已存在"},
        @{@"code": @(30435), @"msg" : @"短信验证间隔太短"},
        @{@"code": @(30436), @"msg" : @"手机号码不存在"},
        @{@"code": @(30443), @"msg" : @"已提交申请，审核中"},
        @{@"code": @(30444), @"msg" : @"需要绑定手机"},
        @{@"code": @(30451), @"msg" : @"昵称涉及敏感信息，修改失败"},
        @{@"code": @(30490), @"msg" : @"您已经拥有靓号"},
        @{@"code": @(30492), @"msg" : @"您购买的靓号不可售"},
        @{@"code": @(30493), @"msg" : @"您购买的靓号已售出"},
        @{@"code": @(30511), @"msg" : @"签名错误"},
        @{@"code": @(30512), @"msg" : @"不能抽取自己送的红包"},
        @{@"code": @(30513), @"msg" : @"红包抽完"},
        @{@"code": @(30515), @"msg" : @"用户不在直播间内"},
        @{@"code": @(30516), @"msg" : @"直播间内已经有红包了"},
        @{@"code": @(30600), @"msg" : @"不能添加自己为好友"},
        @{@"code": @(30601), @"msg" : @"只能加普通用户为好友 "},
        @{@"code": @(30602), @"msg" : @"已经为好友"},
        @{@"code": @(30603), @"msg" : @"不是好友"},
        @{@"code": @(30604), @"msg" : @"好友已超过上限"},
        @{@"code": @(30605), @"msg" : @"消息字数超过上限"},
        @{@"code": @(30606), @"msg" : @"离线消息数目超过上限"},
        @{@"code": @(30607), @"msg" : @"对方已加入你到黑名单"},
        @{@"code": @(30608), @"msg" : @"已加入黑名单"},
        @{@"code": @(30609), @"msg" : @"对方设置不被任何人添加为好友"},
        @{@"code": @(30610), @"msg" : @"当天加好友超过限制"},
        @{@"code": @(30620), @"msg" : @"对方设置不允许富豪等级低于他的玩家添加他为好友"},
        @{@"code": @(30621), @"msg" : @"对方设置仅主播可以加好友"},
        @{@"code": @(30700), @"msg" : @"小窝已开通"},
        @{@"code": @(30701), @"msg" : @"已经加入小窝"},
        @{@"code": @(30702), @"msg" : @"小窝编辑信息错误"},
        @{@"code": @(30703), @"msg" : @"小窝人数已满"},
        @{@"code": @(30704), @"msg" : @"已提交过小窝申请"},
        @{@"code": @(30790), @"msg" : @"麦上已经有人"},
        @{@"code": @(30791), @"msg" : @"此麦上无人"},
        @{@"code": @(30792), @"msg" : @"被踢下麦，3分钟内无法上麦"},
        @{@"code": @(30443), @"msg" : @"已提交申请，等待审核"},
        @{@"code": @(30900), @"msg" : @"用户已被限制"},
        @{@"code": @(32000), @"msg" : @"无法获得用户进入房间时间"},
        @{@"code": @(32001), @"msg" : @"用户不在直播间"},
        @{@"code": @(32002), @"msg" : @"签名错误"},
        @{@"code": @(32003), @"msg" : @"主播还未开播"},
        @{@"code": @(32004), @"msg" : @"还未到达领取时间"},
        @{@"code": @(32005), @"msg" : @"免费礼物下线"}
        ];
}*/
